{
    "projects": [
        {
            "uid": "lpp",
            "name": "Less Powerful Point",
            "subtitle": "LU Main Year 2 Coursework",
            "description": "Powerpoint remake designed for programmers",
            "image": "/Resources/Images/ProjectImages/cwk.jpg",
            "link": "",
            "fullDescription": "This project was the main piece of coursework for our Year 2 project in Lancaster University. In it, we were tasked to create a Microsoft Powerpoint remake from scratch in java designed specifically for programmers. I took on a kind of leadership role for this project, helping to steward a team of 8, and was responsible for much of the design and implementation of the software. The project was coded in Java, utilising the Swing library, and implemented many programmer-specific features such as syntax highlighting, vis code integration and QR code generation as well as the majority of features you'd expect from any good presentation software. The project was a success, and we received a very high grade for it. Unfortunately, I am unable to provide a link to the project as it is not open source, but I am happy to discuss the project and demonstrate it in more detail if you would like to know more."
        },
        {
            "uid": "cvw",
            "name": "CV Website",
            "subtitle": "Custom interactive CV website",
            "description": "This website, to provide an interactive version of my CV",
            "image": "/Resources/Images/ProjectImages/Website.png",
            "link": "https://github.com/ToxikDnb/toxikdnb.github.io",
            "fullDescription": "This is my CV website, the very one you have been navigating for the past while! I aimed to create an interactive CV with this website that can both demonstrate my programming skills, provide a more engaging experience for you as well as allowing me to inject a bit more flavour and personality than a bog-standard CV. I know that efficiency is key when you have hundreds of potential employees to go through, and that is why i still offer a standard CV both as a download from this website and in applications, but also I believe that giving a more demonstrative example of myself before interviews can be a great aid to both you as an employer and me as someone looking for the highest chance of employment. This website was coded in HTML, CSS and JavaScript from scratch, no tools to make life easy or any wordpress or website builders here - this is a pure HTML, CSS and JavaScript website. I hope you enjoy it, and the button below brings you to a complete transparent look at the source code to see how i can build working solutions to problems from scratch!"
        },
        {
            "uid": "mbsdk",
            "name": "MicroBit C++ SDK",
            "subtitle": "User-friendly MicroBit C++ SDK",
            "description": "A user-friendly C++ SDK for the BBC MicroBit",
            "image": "/Resources/Images/ProjectImages/Microbit.webp",
            "link": "",
            "fullDescription": "This project was a personal project I undertook to create a user-friendly C++ SDK for the BBC MicroBit, after working with a less-friendly one during my final-year coursework. The MicroBit is a small, cheap, educational microcontroller packed full of on-board peripherals that is used in schools to teach children the basics of programming. The MicroBit is usually programmed in a language called MicroPython, which is a cut-down version of Python designed to be easy to learn and use. However, I wanted to create a C++ SDK for the MicroBit, as I believe that C++ is a more powerful and versatile language than Python, and would bridge the gap using a MicroBit to learn more complex parts of coding. The MicroBit uses a Nordic nRF52833, and i researched both the schematics of the MicroBit, the product specifications of this chip, and the documentation of all of its peripherals to make this SDK work directly with the in-built hardware as well as many other types of devices. The SDK I created is designed to be easy to use, with a simple and intuitive API that is based off the Arduino system, and allows functionality. The SDK is also designed to be powerful and versatile, with a wide range of features and capabilities that make it suitable for many applications. The SDK is open source, and will be available on GitHub soon. I am happy to discuss the project and demonstrate it in more detail if you would like to know more."
        }
    ]
}
